<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
    <title>Блог</title>
    <link href="https://gibstudio.github.io/ru/blog.atom" rel="self" />
    <subtitle>Genie in a Bottle блог</subtitle>
    <updated>2020-01-03T22:00:00+03:00</updated>
    <author>
        <name>Iaroslav Veikov</name>
    </author>
    <id>https://gibstudio.github.io/blog</id>
            <entry>
        <title>Статистика мобильных игр &quot;Genie in a bottle&quot;</title>
        <id>https://gibstudio.github.io/ru/blog/gibstudio-mobile-games-statistics</id>
        <updated>2020-01-03T22:00:00+03:00</updated>
        <published>2020-01-03T22:00:00+03:00</published>
        <link href="https://gibstudio.github.io/ru/blog/gibstudio-mobile-games-statistics"/>
                <category term="ios" label="Ios" />
                <category term="android" label="Android" />
                <category term="games" label="Games" />
                <category term="statistics" label="Statistics" />
                <category term="app store" label="App store" />
                <category term="google play" label="Google play" />
                <content type="html">
            <![CDATA[
                        <img src="/images/3/4/0/c/c/340ccd96afaac6c32fc34f0ddf058528cdc3eac5-header.png" />
                        <p>Эта статья пока не имеет русского варианта.</p>
            ]]>
        </content>
    </entry>
            <entry>
        <title>Интеграция Cordova в нативный iOS проект</title>
        <id>https://gibstudio.github.io/ru/blog/integration-of-cordova-into-a-native-ios-project</id>
        <updated>2017-11-07T18:00:00+03:00</updated>
        <published>2017-11-07T18:00:00+03:00</published>
        <link href="https://gibstudio.github.io/ru/blog/integration-of-cordova-into-a-native-ios-project"/>
                <category term="ios" label="Ios" />
                <category term="cordova" label="Cordova" />
                <category term="swift" label="Swift" />
                <category term="webview" label="Webview" />
                <category term="hybrid apps" label="Hybrid apps" />
                <category term="development" label="Development" />
                <content type="html">
            <![CDATA[
                        <img src="/images/5/9/d/7/e/59d7eaf59187d80ec93f5e6862740639b4dcaa70-header.png" />
                        <p>&#1055;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1103; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1089;&#1077;&#1088;&#1080;&#1102; &#1089;&#1090;&#1072;&#1090;&#1077;&#1081; &laquo;<a href="https://habrahabr.ru/post/308538">Crosswalk Project &mdash; &#1079;&#1072;&#1084;&#1077;&#1085;&#1072; Android WebView</a>&raquo;, &#1077;&#1089;&#1090;&#1100; &#1089;&#1084;&#1099;&#1089;&#1083; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1091;&#1102; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091; &#1076;&#1083;&#1103; iOS. &#1054;&#1089;&#1085;&#1086;&#1074;&#1086;&#1081; &#1076;&#1083;&#1103; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1101;&#1090;&#1086;&#1090; &#1088;&#1072;&#1079; &#1073;&#1099;&#1083; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; Cordova, &#1090;.&#1082;. &#1086;&#1085; &#1080;&#1084;&#1077;&#1077;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083; &#1080; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1083;&#1091;&#1095;&#1096;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090; &#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;.</p><p>&#1054;&#1073;&#1072; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1080; Cordova, &#1080; Crosswalk &#1086;&#1089;&#1085;&#1086;&#1074;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; WKWebView &#1074; &#1089;&#1074;&#1086;&#1077;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1076;&#1083;&#1103; iOS. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1103;&#1084;&#1086;&#1081; &#1079;&#1072;&#1084;&#1077;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;&#1084;&#1091; WebView &#1086;&#1085;&#1080; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;, &#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1102;&#1090; &#1077;&#1075;&#1086;.</p><p>&#1055;&#1086;&#1083;&#1085;&#1099;&#1081; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;..</p>
            ]]>
        </content>
    </entry>
            <entry>
        <title>Fingertron Адские Гонки</title>
        <id>https://gibstudio.github.io/ru/blog/fingertron-demon-racing</id>
        <updated>2017-09-12T12:00:00+03:00</updated>
        <published>2017-09-12T12:00:00+03:00</published>
        <link href="https://gibstudio.github.io/ru/blog/fingertron-demon-racing"/>
                <category term="ios" label="Ios" />
                <category term="games" label="Games" />
                <content type="html">
            <![CDATA[
                        <img src="/images/2/8/3/1/8/283186a1cbb2f04e024b08bc9b2fa1bae32e8c45-header.jpeg" />
                        <p>&#1042;&#1089;&#1077;&#1084; &#1087;&#1088;&#1080;&#1074;&#1077;&#1090;. &#1061;&#1086;&#1095;&#1091; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;. &#1052;&#1099; &#1089; &#1090;&#1086;&#1074;&#1072;&#1088;&#1080;&#1097;&#1077;&#1084; &#1074;&#1099;&#1087;&#1091;&#1089;&#1090;&#1080;&#1083;&#1080; &#1077;&#1097;&#1105; &#1086;&#1076;&#1085;&#1091; &#1080;&#1075;&#1088;&#1091; &#1087;&#1086;&#1076; iOS. &#1055;&#1077;&#1088;&#1074;&#1086;&#1081; &#1073;&#1099;&#1083;&#1072; <a href="/ru/turbofinger">Turbofinger Arcade Racing</a> &#1080; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1083;&#1072;&#1089;&#1100; <a href="/ru/fingertron">Fingertron Demon Racing</a>. &#1045;&#1089;&#1083;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086; - &#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077;, &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; <a href="https://twitter.com/gibstudio">Twitter</a> &#1080; stay tuned!</p><p><strong>Fingertron Demon Racing</strong> - &#1101;&#1090;&#1086; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1093;&#1086;&#1073;&#1073;&#1080;-&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;. &#1052;&#1099; &#1086;&#1073;&#1072; &#1080;&#1084;&#1077;&#1077;&#1084; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1082; &#1080;&#1075;&#1088;&#1086;&#1074;&#1086;&#1081; &#1080;&#1085;&#1076;&#1091;&#1089;&#1090;&#1088;&#1080;&#1080;, &#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;&#1075;&#1088; &#1085;&#1072;&#1084; &#1087;...</p>
            ]]>
        </content>
    </entry>
            <entry>
        <title>Сборка Android под Mac OS X</title>
        <id>https://gibstudio.github.io/ru/blog/build-android-mac-os</id>
        <updated>2017-04-30T19:00:00+03:00</updated>
        <published>2017-04-30T19:00:00+03:00</published>
        <link href="https://gibstudio.github.io/ru/blog/build-android-mac-os"/>
                <category term="macos" label="Macos" />
                <category term="android" label="Android" />
                <category term="build" label="Build" />
                <category term="development" label="Development" />
                <content type="html">
            <![CDATA[
                        <img src="/images/3/9/f/4/0/39f40831374cc8e5dc4c2833637474040c032013-header.jpeg" />
                        <p>&#1044;&#1083;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1076;&#1086;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072;&#1084;&#1080; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; Android &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1096;&#1080;&#1074;&#1082;&#1080; &#1087;&#1086;&#1076; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1091;&#1102; &#1078;&#1077;&#1083;&#1077;&#1079;&#1082;&#1091;. &#1042;&#1077;&#1088;&#1089;&#1080;&#1103; &#1076;&#1083;&#1103; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; &#1073;&#1099;&#1083;&#1072; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1072; &#1091;&#1078;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1090;&#1072;&#1088;&#1072;&#1103; &mdash; AOSP 4.0.4, &#1085;&#1086; &#1085;&#1072; &#1085;&#1077;&#1081; &#1073;&#1072;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1072;&#1103; &#1074;&#1077;&#1090;&#1082;&#1072; &#1082;&#1086;&#1076;&#1072; &#1086;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103; &#1078;&#1077;&#1083;&#1077;&#1079;&#1082;&#1080;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1077;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1086;&#1076; Android &#1103; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1089;&#1100; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1086;&#1081; iOS &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102; &#1087;&#1086;&#1076; Mac OS X &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102; Xcode &#1082;&#1072;&#1082; &#1086;&#1076;&#1085;&#1091; &#1080;&#1079; &#1089;&#1088;&#1077;&#1076; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;.</p><p>&#1055;&#1086;&#1083;&#1085;&#1099;&#1081; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1090;&#1077;...</p>
            ]]>
        </content>
    </entry>
    </feed>
